; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v6 ?v2)
             (pred_1 ?v11 ?v10)
             (pred_10 ?v6 ?v10)
             (pred_11 ?v13 ?v6 )
	     (pred_9 ?v6)
             (pred_3 ?v5)
             (pred_12 ?v11)
             (pred_2 ?v10)
             (pred_8 ?v6)
             (pred_5 ?v11)
             (pred_6 ?v6)
             (pred_7 ))



(:action op_2
:parameters (?v8 ?v1 ?v9 ?v7)
:precondition (and (pred_3 ?v8) (pred_3 ?v1) (pred_12 ?v9) (pred_2 ?v7)
          (pred_4 ?v8 ?v1) (pred_1 ?v9 ?v7)
                   (pred_10 ?v1 ?v7) (pred_9 ?v8) 
                   (pred_8 ?v1) (pred_5 ?v9))
:effect (and  (pred_6 ?v1) (not (pred_8 ?v1))))


(:action op_1
:parameters (?v8 ?v4)
:precondition (and (pred_3 ?v8) (pred_3 ?v4)
               (pred_9 ?v8) (pred_4 ?v8 ?v4) (pred_6 ?v4))
:effect (and (pred_9 ?v4) (not (pred_9 ?v8))))

(:action op_3
:parameters (?v8 ?v9)
:precondition (and (pred_3 ?v8) (pred_12 ?v9) 
                  (pred_9 ?v8) (pred_11 ?v9 ?v8) (pred_7 ))
:effect (and (pred_5 ?v9)
   (not (pred_11 ?v9 ?v8)) (not (pred_7 ))))


(:action op_4
:parameters (?v8 ?v12 ?v3)
:precondition (and (pred_3 ?v8) (pred_12 ?v12) (pred_12 ?v3)
                  (pred_9 ?v8) (pred_5 ?v3) (pred_11 ?v12 ?v8))
:effect (and (pred_5 ?v12) (pred_11 ?v3 ?v8)
        (not (pred_5 ?v3)) (not (pred_11 ?v12 ?v8))))

(:action op_5
:parameters (?v8 ?v9)
:precondition (and (pred_3 ?v8) (pred_12 ?v9) 
                  (pred_9 ?v8) (pred_5 ?v9))
:effect (and (pred_7 ) (pred_11 ?v9 ?v8) (not (pred_5 ?v9)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_12 obj_03 obj_08 obj_14 obj_16 obj_01 obj_06 obj_15 obj_20 obj_07 obj_09 obj_17 obj_11 obj_02 obj_05 obj_10
    obj_13 obj_04
    obj_18 obj_19
    )

    (:init
       (pred_7)

       (pred_3 obj_12)
       (pred_3 obj_03)
       (pred_3 obj_08)
       (pred_3 obj_14)
       (pred_3 obj_16)
       (pred_3 obj_01)
       (pred_3 obj_06)
       (pred_3 obj_15)
       (pred_3 obj_20)
       (pred_3 obj_07)
       (pred_3 obj_09)
       (pred_3 obj_17)
       (pred_3 obj_11)
       (pred_3 obj_02)
       (pred_3 obj_05)
       (pred_3 obj_10)
       (pred_2 obj_13)
       (pred_2 obj_04)
       (pred_12 obj_18)
       (pred_12 obj_19)

       (pred_4 obj_12 obj_16)
       (pred_4 obj_12 obj_03)
       (pred_4 obj_03 obj_01)
       (pred_4 obj_03 obj_08)
       (pred_4 obj_03 obj_12)
       (pred_4 obj_08 obj_06)
       (pred_4 obj_08 obj_14)
       (pred_4 obj_08 obj_03)
       (pred_4 obj_14 obj_15)
       (pred_4 obj_14 obj_08)
       (pred_4 obj_16 obj_20)
       (pred_4 obj_16 obj_01)
       (pred_4 obj_16 obj_12)
       (pred_4 obj_01 obj_07)
       (pred_4 obj_01 obj_06)
       (pred_4 obj_01 obj_03)
       (pred_4 obj_01 obj_16)
       (pred_4 obj_06 obj_09)
       (pred_4 obj_06 obj_15)
       (pred_4 obj_06 obj_08)
       (pred_4 obj_06 obj_01)
       (pred_4 obj_15 obj_17)
       (pred_4 obj_15 obj_14)
       (pred_4 obj_15 obj_06)
       (pred_4 obj_20 obj_11)
       (pred_4 obj_20 obj_07)
       (pred_4 obj_20 obj_16)
       (pred_4 obj_07 obj_02)
       (pred_4 obj_07 obj_09)
       (pred_4 obj_07 obj_01)
       (pred_4 obj_07 obj_20)
       (pred_4 obj_09 obj_05)
       (pred_4 obj_09 obj_17)
       (pred_4 obj_09 obj_06)
       (pred_4 obj_09 obj_07)
       (pred_4 obj_17 obj_10)
       (pred_4 obj_17 obj_15)
       (pred_4 obj_17 obj_09)
       (pred_4 obj_11 obj_02)
       (pred_4 obj_11 obj_20)
       (pred_4 obj_02 obj_05)
       (pred_4 obj_02 obj_07)
       (pred_4 obj_02 obj_11)
       (pred_4 obj_05 obj_10)
       (pred_4 obj_05 obj_09)
       (pred_4 obj_05 obj_02)
       (pred_4 obj_10 obj_17)
       (pred_4 obj_10 obj_05)
       (pred_8 obj_01)
       (pred_8 obj_06)
       (pred_10  obj_01 obj_13)
       (pred_10  obj_06 obj_04)
       (pred_6 obj_12)
       (pred_6 obj_03)
       (pred_6 obj_08)
       (pred_6 obj_14)
       (pred_6 obj_16)
       (pred_6 obj_15)
       (pred_6 obj_20)
       (pred_6 obj_07)
       (pred_6 obj_09)
       (pred_6 obj_17)
       (pred_6 obj_11)
       (pred_6 obj_02)
       (pred_6 obj_05)
       (pred_6 obj_10)

       (pred_1  obj_18 obj_13)
       (pred_1  obj_19 obj_04)
       (pred_11 obj_18 obj_03)
       (pred_11 obj_19 obj_11)
       (pred_9 obj_11)
    )

    (:goal (and
       (pred_11 obj_18 obj_02)
    ))
(:constraints
  (always (not (pred_9 obj_07)))
)
)

; plan
1. (op_3 obj_11 obj_19)
   deleted: (pred_11 obj_19 obj_11) (pred_7)
   added: (pred_5 obj_19)
   goals met: 0 of 1
2. (op_1 obj_11 obj_02)
   deleted: (pred_9 obj_11)
   added: (pred_9 obj_02)
   goals met: 0 of 1
3. (op_5 obj_02 obj_19)
   deleted: (pred_5 obj_19)
   added: (pred_7) (pred_11 obj_19 obj_02)
   goals met: 0 of 1
4. (op_1 obj_02 obj_11)
   deleted: (pred_9 obj_02)
   added: (pred_9 obj_11)
   goals met: 0 of 1
5. (op_1 obj_11 obj_20)
   deleted: (pred_9 obj_11)
   added: (pred_9 obj_20)
   goals met: 0 of 1
6. (op_1 obj_20 obj_16)
   deleted: (pred_9 obj_20)
   added: (pred_9 obj_16)
   goals met: 0 of 1
7. (op_1 obj_16 obj_12)
   deleted: (pred_9 obj_16)
   added: (pred_9 obj_12)
   goals met: 0 of 1
8. (op_1 obj_12 obj_03)
   deleted: (pred_9 obj_12)
   added: (pred_9 obj_03)
   goals met: 0 of 1
9. (op_3 obj_03 obj_18)
   deleted: (pred_11 obj_18 obj_03) (pred_7)
   added: (pred_5 obj_18)
   goals met: 0 of 1
10. (op_2 obj_03 obj_01 obj_18 obj_13)
   deleted: (pred_8 obj_01)
   added: (pred_6 obj_01)
   goals met: 0 of 1
11. (op_1 obj_03 obj_01)
   deleted: (pred_9 obj_03)
   added: (pred_9 obj_01)
   goals met: 0 of 1
12. (op_1 obj_01 obj_16)
   deleted: (pred_9 obj_01)
   added: (pred_9 obj_16)
   goals met: 0 of 1
13. (op_1 obj_16 obj_20)
   deleted: (pred_9 obj_16)
   added: (pred_9 obj_20)
   goals met: 0 of 1
14. (op_1 obj_20 obj_11)
   deleted: (pred_9 obj_20)
   added: (pred_9 obj_11)
   goals met: 0 of 1
15. (op_1 obj_11 obj_02)
   deleted: (pred_9 obj_11)
   added: (pred_9 obj_02)
   goals met: 0 of 1
16. (op_4 obj_02 obj_19 obj_18)
   deleted: (pred_5 obj_18) (pred_11 obj_19 obj_02)
   added: (pred_5 obj_19) (pred_11 obj_18 obj_02)
   goals met: 1 of 1
